app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" ORDER BY "courses"."updated_at" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "courses".* FROM "courses"
---
  def index
		@course = Course.order(updated_at: :desc).limit(1)
		@courses = Course.all

INSERT INTO "courses" ("start", "destination", "created_at", "updated_at", "waypoints", "transportation") VALUES (?, ?, ?, ?, ?, ?)  [["start", "奈良"], ["destination", "梅田"], ["created_at", "2024-02-20 07:46:59.903783"], ["updated_at", "2024-02-20 07:46:59.903783"], ["waypoints", "大阪"], ["transportation", "driving"]]
---
	def create
    course = Course.new(course_params)
    if course.save