app/controllers/posts_controller.rb

    def index
        @history = Post.all
---
SELECT "posts".* FROM "posts"

    def new
		@course = Course.order(updated_at: :desc).limit(1)
		@courses = Course.all
---
SELECT "courses".* FROM "courses" ORDER BY "courses"."updated_at" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "courses".* FROM "courses"

    def create
        @post = Post.new(post_params)
        @post.userid = current_user.id
        @post.save
---
INSERT INTO "posts" ("history", "created_at", "updated_at") VALUES (?, ?, ?)  [["history", "大阪駅,walking,1時間3分,大阪難波"], ["created_at", "2024-02-23 02:47:54.436478"], ["updated_at", "2024-02-23 02:47:54.436478"]]